package lesson_2

fun main() {
    val gradePupil1 = 3.00
    val gradePupil2 = 4.00
    val gradePupil3 = 3.00
    val gradePupil4 = 5.00
    val numOfGrade = 4
    val sumOfGrade = gradePupil1 + gradePupil2 + gradePupil3 + gradePupil4
    val averageOfGrade = sumOfGrade / numOfGrade

    println(averageOfGrade)
}

/*
арифметические знаки обосабливаются пробелами)
 */

/*
Задача 1 к Уроку 2

Задача на среднее арифметическое. В классе с углубленным изучением английского языка учится 4 человека.
У них следующие баллы по профильному предмету 3, 4, 3, 5.
Пишем часть школьного софта, который посчитает средний балл по английскому для этого класса.

 – Написать выражение, которое высчитывает средний балл;
 – Распечатать результат в консоль;
 – В консоли должно быть выведено дробное число с 2 знаками после запятой.
 */