package lesson_1

fun main() {
    val numOfOrders = 75
    val thxForOrder = "Thank you for your order."
    println(numOfOrders)
    println(thxForOrder)
}

/*
привет! по оформлению пулл реквеста все отлично. нейминг ПР и ветки ок!
единственное что у тебя вместо названия репозитория - номер урока. Переименуй плз)

после этого можно мержить в мастер.
перед созданием новой ветки не забудь переключиться в мастер и обновить его (клик по ветке и Update).
чтобы смерженные изменения в гитхабе долетели до локального проекта
// */


