package lesson_1

fun main() {
    val numOfOrders = 75
    val thxForOrder = "Thank you for your order."
    println(numOfOrders)
    println(thxForOrder)
}

/*
привет! по оформлению пулл реквеста все отлично. нейминг ПР и ветки ок!
единственное что у тебя вместо названия репозитория - номер урока. Переименуй плз)

после этого можно мержить в мастер.
перед созданием новой ветки не забудь переключиться в мастер и обновить его (клик по ветке и Update).
чтобы смерженные изменения в гитхабе долетели до локального проекта
// */

/*
Задача 1 к Уроку 1

Пишем логику экрана приложения для интернет-магазина.
Представим, что у интернет-магазина было 75 заказов.
Нужно продумать релевантные названия и корректно объявить 2 переменные, которые будут содержать:
 – количество заказов,
 – текст с благодарностью за покупку (текст на твое усмотрение).
Задай “говорящие” наименования переменных (например, для сторон прямоугольника не a и b, а height и width).
Названия переменных должны состоять из нескольких слов. Тип переменных указывать принудительно.
 */


