package lesson_1

fun main() {
    val numOfOrders = 75
    val thxForOrder = "Thank you for your order."
    println(numOfOrders)
    println(thxForOrder)
    var numOfEmployees = 2000
    //println(numOfEmployees)
    numOfEmployees--
    println(numOfEmployees)
}

/*
все чисто, еще на будущее рекомендую отделять блок с объявлением переменных от всего остального кода для лучшей наглядности
 */

/*
Задача 2 к Уроку 1

Скопируй решение из задачи 1 в новый файл с задачей 2.
Теперь необходимо дописать реализацию программы для новых целей. Имитируем логи с сервера.

 – Для начала выведи в консоль значения всех объявленных ранее переменных;
 – Далее нужно сделать так, чтобы программа хранила количество работников данного интернет-магазина (2000). П
 одбери подходящее наименование переменной, присвой ей значение и распечатай;
 – Далее представим, что один работник уволился. Закомментируй предыдущий код с распечаткой количества работников,
 присвой новое значение количества работников этой переменной и распечатай в консоль.

Оценивается не только правильная последовательность действий, но и грамотная организация кода
(порядок объявления, отступы и так далее).
 */