package lesson_9

fun main() {
    val ingredientsList = listOf("соль", "сахар", "масло", "капуста", "лимон", "лук")

    println("В рецепте есть следующие ингредиенты:\n${ingredientsList.joinToString("\n")}")
}

/*
Задача 1 к Уроку 9

Продолжи разработку приложения с рецептами, но с реализацией через список.
Создай список ингредиентов блюда в виде списка, инициализируй любыми значениями.

 – выведи в консоль сообщение: "В рецепте есть следующие ингредиенты: [список_ингредиентов]";
 – выведи все ингредиенты, каждый с новой строки. */

/*
* */